In [1]:
import mysql.connector as mariadb
import pandas as pd
import psycopg2

financial_conn_string = {
    'host': 'relational.fit.cvut.cz',
    'port': '3306',
    'user': 'guest',
    'password': 'relational',
    'database': 'financial'
}

Firstly I import the necessary library to connect with the MariaDB Database. I then set up the database connection parameters and store this in the 'financial_conn_string' variable.

In [2]:
def fetch_data_from_mariadb(conn_params, query):
    with mariadb.connect(**conn_params) as conn:
        with conn.cursor() as cur:
            cur.execute(query)
            data = cur.fetchall()
            colnames = [desc[0] for desc in cur.description]
    return data, colnames

financial_query_transactions = "SELECT * FROM trans;"
financial_data_transactions, transactions_colnames = fetch_data_from_mariadb(financial_conn_string, financial_query_transactions)

Then I define a function to fetch the data from MariaDB. This function takes two arguments:
- conn_params = the database connection
- query = the sql query to execute.
    
I used a 'with' statement to create a connection to the MariaDB database using the 'mariadb.connect()' method. 
I then create a cursor using 'with conn.cursor() as cur' to interact with the database and execute queries.
The query is executed using 'cur.execute(query)' and the result is fetched using 'data = cur.fetchall()' and stored in 'data'. The column names are retrieved from the cursors description using a list comprehension 'colnames = [desc[0] for desc in cur.description]' and stored in 'colnames'. I then return the data and colnames.

I define a variable called 'financial_query_transactions' and put a SQL SELECT query to fetch all records from the 'trans' table. Finally I use the 'fetch_data_from_mariadb()' function to fetch data from the 'trans' table and store this data in the columns 'financial_data_transactions, transactions_colnames'

In [15]:
transactions_df = pd.DataFrame(financial_data_transactions, columns=transactions_colnames)
avg_transaction_amount = transactions_df.groupby('account_id')['amount'].mean().reset_index()
avg_transaction_amount.columns = ['AccountID', 'AverageTransactionAmount']

In this next part of the code, I use the pandas library to manipulate some of the data I fetched.

First I load the fetched data into the dataframe and store this in a variable called 'transactions_df'. The columns parameter is set to 'transactions_colnames', which contained the column names fetched earlier.

To calculate the average transaction amount I group the data in the dataframe based on the 'account_id' column and then calculates the average(mean) of the 'amount' column within each group. This will give the average transaction amount for each unique account ID.

I reset the index of this grouped Dataframe. This converts the group labels (account IDs) back into regular columns.

Lastly I rename the columns to 'AccountID', 'AverageTransactionAmount' for better readability.

In [16]:
etl_bites_conn_string = """
                host='localhost' 
                port='5432' 
                dbname='etl_bites' 
                user='ilhaam.ahmed' 
                password='dataproj'
                """

I use psycopg2 to insert the transformed data in bulk into the local PostgreSQL database (etl_bites).
We will need a connection string as well for the destination database (our local PostgreSQL one).

In [22]:
# Create tables in analytical DB
# This could also be done manually via a GUI (e.g. TablePlus) or with a SQL script
def execute_query_postgresql(conn_string, query):
    with psycopg2.connect(conn_string) as conn:
        with conn.cursor() as cur:
            cur.execute(query)
            conn.commit()

create_average_transaction_amount_table = '''
CREATE TABLE average_transaction_amount (
    AccountID INTEGER NOT NULL,
    AverageTransactionAmount NUMERIC(15, 2) NOT NULL
);
'''

execute_query_postgresql(etl_bites_conn_string, create_average_transaction_amount_table)

def insert_data_to_postgresql(conn_string, table_name, data, columns):
    with psycopg2.connect(conn_string) as conn:
        with conn.cursor() as cur:
            for row in data.itertuples(index=False):
                insert_query = f"INSERT INTO {table_name} ({', '.join(columns)}) VALUES ({', '.join(['%s'] * len(columns))});"
                cur.execute(insert_query, row)
            conn.commit()

table_name = "average_transaction_amount"
columns = ['AccountID', 'AverageTransactionAmount']
insert_data_to_postgresql(etl_bites_conn_string, table_name, avg_transaction_amount, columns)

First I define a function that is used to execute a SQL query on a postgres database. A cursor is created to execute the query and once the query is executed it is commited to the database.

Then I create a variable that stores the SQL query to create a table named 'average_transaction_amount' in the database.

This function execute_query_postgresql() is used to execute the query in the database.

I then create another function to insert the data into a specified table in the postgres database, it takes four parameters. Inside the function a connection is established with the postgres database. Then a cursor is created to execute the insert queries. For each row in the dataframe, an insert query is constructed using the table_name and columns, The changes are commited to the database.

I define the table_name and the list of column names to be used when inserting the data into the average transaction amount table.

Finally, I use the insert_data_to_postgresql() function to insert data from the dataframe into the table.

## Exercise

### Calculate the sum of all positive and negative transactions per account.

In [23]:
# Transform

transactions_df = pd.DataFrame(financial_data_transactions, columns=transactions_colnames)
positive_transactions_sum = transactions_df[transactions_df['amount'] > 0].groupby('account_id')['amount'].sum().reset_index()
negative_transactions_sum = transactions_df[transactions_df['amount'] < 0].groupby('account_id')['amount'].sum().reset_index()

positive_transactions_sum.columns = ['AccountID', 'PositiveAmountSum']
negative_transactions_sum.columns = ['AccountID', 'NegativeAmountSum']

In [40]:
# Load

analytical_conn_string = """
                host='localhost' 
                port='5432' 
                dbname='etl_bites' 
                user='ilhaam.ahmed' 
                password='dataproj'
                """

def execute_query_analytical_db(conn_string, query):
    with psycopg2.connect(conn_string) as conn:
        with conn.cursor() as cur:
            cur.execute(query)
            conn.commit()

# check if table exists before creating them
def table_exists(conn_string, table_name):
    with psycopg2.connect(conn_string) as conn:
        with conn.cursor() as cur:
            cur.execute(f"SELECT EXISTS (SELECT 1 FROM information_schema.tables WHERE table_name = '{table_name}')")
            return cur.fetchone()[0]

# Create new tables

if not table_exists(analytical_conn_string, "positive_transactions_sum"):
    create_positive_transactions_sum_table = '''
    CREATE TABLE positive_transactions_sum (
        AccountID INTEGER NOT NULL,
        PositiveAmountSum NUMERIC(15, 2) NOT NULL
    );
    '''
    execute_query_postgresql(analytical_conn_string, create_positive_transactions_sum_table)

if not table_exists(analytical_conn_string, "negative_transactions_sum"):
    create_negative_transactions_sum_table = '''
    CREATE TABLE negative_transactions_sum (
        AccountID INTEGER NOT NULL,
        NegativeAmountSum NUMERIC(15, 2) NOT NULL
    );
    '''
    execute_query_postgresql(analytical_conn_string, create_negative_transactions_sum_table)


def insert_data_to_analytical_db(conn_string, table_name, data, columns):
    with psycopg2.connect(conn_string) as conn:
        with conn.cursor() as cur:
            for row in data.itertuples(index=False):
                insert_query = f"INSERT INTO {table_name} ({', '.join(columns)}) VALUES ({', '.join(['%s'] * len(columns))});"
                cur.execute(insert_query, row)
            conn.commit()

table_name_positive = "positive_transactions_sum"
columns_positive = ['AccountID', 'PositiveAmountSum']
insert_data_to_analytical_db(analytical_conn_string, table_name_positive, positive_transactions_sum, columns_positive)

table_name_negative = "negative_transactions_sum"
columns_negative = ['AccountID', 'NegativeAmountSum']
insert_data_to_analytical_db(analytical_conn_string, table_name_negative, negative_transactions_sum, columns_negative)

## Challenge

### For each account, find the account's creation date and the total amount of all loans associated with that account.

In [62]:
def fetch_data_from_mariadb(conn_params, query):
    with mariadb.connect(**conn_params) as conn:
        with conn.cursor() as cur:
            cur.execute(query)
            data = cur.fetchall()
            colnames = [desc[0] for desc in cur.description]
    return data, colnames

account_loan_query = '''
SELECT
    a.account_id,
    a.date AS account_creation_date,
    COALESCE(SUM(l.amount), 0) AS total_loan_amount
FROM
    account a
LEFT JOIN
    loan l ON a.account_id = l.account_id
GROUP BY 
    a.account_id, a.date;
'''

result_data, result_columns = fetch_data_from_mariadb(financial_conn_string, account_loan_query)
result_df = pd.DataFrame(result_data, columns=result_columns)
result_df

      account_id account_creation_date total_loan_amount
0              1            1995-03-24                 0
1              2            1993-02-26             80952
2              3            1997-07-07                 0
3              4            1996-02-21                 0
4              5            1997-05-30                 0
...          ...                   ...               ...
4495       11333            1994-05-26                 0
4496       11349            1995-05-26            419880
4497       11359            1994-10-01             54024
4498       11362            1995-10-14            129408
4499       11382            1995-08-20                 0

[4500 rows x 3 columns]

## My approach to tackling this challenge:

- I began by fetching the data from the MariaDB database.
- Then I created a query to find the creation date and total amount of loans associated with each account.
    - In my query I selected the account id column, the date column and the amount column summed. I used the COALESCE function to used a LEFT JOIN in my query to handle cases where there are no loans associated with an account. The coalesce function replaces the NULL value with 0 if SUM(l.amount) finds no loans.
- I used a LEFT-JOIN between the account and loan tables, this will return all rows from the left table 'account' and the matching rows from the right table 'loan'.
- Finally, I group by 'account id' and 'date created'.
- I use the financial_conn_string which I already established in an earlier exercise, and use the fetch_data_from_mariadb() function to fetch the data.
- I store this in a DataFrame in order to view it.